{"offset": 0, "number": 10, "available": 25414, "news": [{"id": 310979776, "title": "World unites in praise of McIlroy after momentous Masters triumph", "text": "TCF vendors\n\nExponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nRoq.ad GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdMaxim LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Probabilistic identifiers, Browsing and interaction datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nIndex Exchange Inc. Cookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nQuantcastCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSovrn, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdikteevDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Non-precise location data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nRTB House S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nThe UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNexxen Inc.Cookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEpsilonCookie duration: 1832 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nYahoo EMEA LimitedCookie duration: 750 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nADventori SASCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTriple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nXandr, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNEORY GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nNexxen Group LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nNEURAL.ONECookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nADITION (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nActive Agent (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTaboola Europe LimitedCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEquativCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdform A/SCookie duration: 3650 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite, Inc. Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nSift Media, IncDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location datamoreView details | Privacy policy\n\nRakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLumen Research LimitedDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOpenXCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nYieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRoku Advertising ServicesCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nSimplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Precise location datamoreUses other forms of storage.View details | Privacy policy\n\nPubMatic, IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nComscore B.V.Cookie duration: 720 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nFlashtalkingCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nPulsePoint, Inc.Cookie duration: 1830 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSmaato, Inc.Cookie duration: 21 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSemasio GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCrimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nGenius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCriteo SACookie duration: 390 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdloox SADoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nBlis Global LimitedCookie duration: 400 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nLotame Solutions, IncCookie duration: 274 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveRampCookie duration: 3653 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nGroupM UK LimitedCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLoopMe LimitedCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDynata LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAsk LocalaDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nAziraDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nDoubleVerify Inc.​Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nBIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nIPONWEB GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNextRoll, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTeads France SASCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nStröer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nOS Data Solutions GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPermodo GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nPlatform161 B.V.Cookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBasis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBombora Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEASYmedia GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRemerge GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nadvanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDelta Projects ABCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nusemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nemetriq GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPublicis Media GmbHCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nM.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreView details | Storage details | Privacy policy\n\nOneTag LimitedCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nCloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSmartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policy\n\nImprove DigitalCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdobe Advertising CloudCookie duration: 730 (days).Data collected and processed: IP addresses, Device identifiers, Authentication-derived identifiers, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTabMo SASDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nIntegral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nWizalyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nWeboramaCookie duration: 393 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nJivox CorporationCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSojern, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nVistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policy\n\nOn Device Research LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRockabox Media LtdDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nExactag GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nCeltra Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Precise location datamoreUses other forms of storage.View details | Storage details | Privacy policy\n\nmainADV SrlCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGemius SACookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nThe Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nNielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSolocal SACookie duration: 398 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPixalate, Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nNumberlyCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAudienceProject A/SCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDemandbase, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEffiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nArrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSeenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policy\n\nCommanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policy\n\ntravel audience GmbHCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHUMANDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreView details | Privacy policy\n\nBlendee srlCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nInnovid LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPapirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policy\n\nNeustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nVerve Group Europe GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOtto GmbH & Co. KGaACookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLocalsensor B.V.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOnline SolutionCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nRelay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nGP One GmbHCookie duration: Uses session cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nLiftoff Monetize and Vungle ExchangeDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nThe MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nReppublika Research & Analytics Austria GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nCint ABCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGoogle Advertising ProductsCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGfK GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nRevJetCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nProtected Media LTDDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction datamoreView details | Privacy policy\n\nClinch Labs LTDCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nHearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policy\n\nAmazon AdvertisingCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMoloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location datamoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdtriba GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nEnsightenCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nMetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided datamoreUses other forms of storage.View details | Privacy policy\n\nHurra Communications GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAd partners\n\nAkamaiPrivacy policy\n\nMetaPrivacy policy\n\nAunicaPrivacy policy\n\nBooking.comPrivacy policy\n\nC3 MetricsPrivacy policy\n\nIBMPrivacy policy\n\neBayPrivacy policy\n\nEvidonPrivacy policy\n\nAdacadoPrivacy policy\n\nintelliAdPrivacy policy\n\nDstilleryPrivacy policy\n\nMediaMathPrivacy policy\n\nSizmekPrivacy policy\n\nZMSPrivacy policy\n\nOmnicom Media GroupPrivacy policy\n\nResonatePrivacy policy\n\nSmartPrivacy policy\n\nTradedoubler ABPrivacy policy\n\nTrustArcPrivacy policy\n\nTruEffectPrivacy policy\n\nTravel Data CollectivePrivacy policy\n\nadvolution.controlPrivacy policy\n\nLifeStreetPrivacy policy\n\nBatch MediaPrivacy policy\n\nVodafone GmbHPrivacy policy\n\nMagnitePrivacy policy\n\nScenestealerPrivacy policy\n\nNetquestPrivacy policy\n\nManage.comPrivacy policy\n\nCloudflarePrivacy policy\n\nSalesforce DMPPrivacy policy\n\nNetflixPrivacy policy\n\nebuildersPrivacy policy\n\nAppLovin Corp.Privacy policy\n\nFractional MediaPrivacy policy\n\nRackspacePrivacy policy\n\nMSI-ACIPrivacy policy\n\nAdmetricsPrivacy policy\n\nNaveggPrivacy policy\n\nAdmedoPrivacy policy\n\nKochavaPrivacy policy\n\nMobitransPrivacy policy\n\nADEXPrivacy policy\n\nImpactPrivacy policy\n\nSpotadPrivacy policy\n\nAarkiPrivacy policy\n\nSFRPrivacy policy\n\nCablatoPrivacy policy\n\nWaystackPrivacy policy\n\nTreSensaPrivacy policy\n\nAdludioPrivacy policy\n\ngskinnerPrivacy policy\n\nCUBEDPrivacy policy\n\nOptomatonPrivacy policy\n\nDentsu Aegis NetworkPrivacy policy\n\nDigisegPrivacy policy\n\nHaensel AMSPrivacy policy\n\nBDSK Handels GmbH & Co. KGPrivacy policy\n\nObjective PartnersPrivacy policy\n\nMarketing Science Consulting Group, Inc.Privacy policy\n\nDENTSUPrivacy policy\n\nKoblerPrivacy policy\n\nWidespacePrivacy policy\n\nVimeoPrivacy policy\n\nOracle Data CloudPrivacy policy", "summary": "", "url": "https://www.channelnewsasia.com/sport/world-unites-praise-mcilroy-after-momentous-masters-triumph-5064701", "image": "https://dam.mediacorp.sg/image/upload/s--j0UGy99i--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-04-14t105643z_1_lynxmpel3d0e7_rtroptp_3_golf-masters.jpg?itok=l9t2V", "video": null, "publish_date": "2025-04-14 10:56:43", "author": null, "language": "en", "source_country": "sg", "sentiment": 0.186}, {"id": 310979772, "title": "Singapore economy expected to slow, but analysts split on whether technical recession is likely", "text": "For monetary policy, the Monetary Authority of Singapore (MAS) said it would \"reduce slightly\" the rate of appreciation of the Singapore dollar nominal effective exchange rate (S$NEER).\n\nThat means the local currency will likely weaken or strengthen at a slower pace, which typically helps to boost exports.\n\n\"(The) easing decision suggests that the paramount priority for the MAS is to support growth in this significantly uncertain global trade with a lack of clarity regarding tariff directions,\" HSBC Global Research said in a report.\n\nMAS took a measured approach because it meets four times a year instead of twice, which was the case before 2024.\n\n\"Higher frequency of meetings gives the MAS the flexibility to adjust its monetary settings in a timelier manner, particularly in a world lacking clarity on tariff directions,\" HSBC said.\n\nIt added that MAS took a \"dovish\" tone, suggesting that the central bank remains open to further easing of policy.\n\nMs Ling of OCBC similarly said there is room for further monetary policy easing if economic conditions worsen.\n\n\"The rhetoric is clearly dovish with reference to the output gap turning negative and the downside inflation risks,\" she said. MAS lowered its core inflation forecast to 0.5 per cent to 1.5 per cent for 2025.\n\nSINGAPORE DOLLAR OUTLOOK\n\nDespite the actions by MAS, the Singapore dollar is likely to remain relatively strong, analysts said. \n\nHSBC said the currency rebounded after the US dollar index fell, and the S$NEER rose after MAS released its monetary policy statement.\n\n“All in, we think it is difficult to have a bearish SGD trade idea at this juncture,” the bank said.\n\nMr Christopher Wong, an FX strategist at OCBC, said he expects the Singdollar to trade between 1.31 and 1.325 against the greenback.\n\nGiven the implication of Trump's tariffs on growth, trade and sentiments, as well as potential MAS policy easing, the Singapore dollar is likely to weaken against the US dollar for 2025.\n\nHowever, if the Euro and Chinese yuan recover, or the US dollar persists in weakening, then that would support the Singapore dollar, he said.", "summary": "Analysts say that Singapore stands ready to take action to support its economy through fiscal measures and monetary policy.", "url": "https://www.channelnewsasia.com/singapore/economy-outlook-tariffs-technical-recession-gdp-5064471", "image": "https://dam.mediacorp.sg/image/upload/s--s3ljt4k5--/c_crop,h_823,w_1463,x_17,y_23/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2023/05/03/sya_7306.jpg?itok=IeXhCPm-", "video": null, "publish_date": "2025-04-14 11:51:15", "author": "Abigail Ng", "authors": ["Abigail Ng"], "language": "en", "source_country": "sg", "sentiment": -0.158}, {"id": 310979774, "title": "Meta faces landmark US antitrust trial that could force it to sell Instagram", "text": "TCF vendors\n\nExponential Interactive, Inc d/b/a VDX.tvCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nRoq.ad GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdMaxim LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Probabilistic identifiers, Browsing and interaction datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nIndex Exchange Inc. Cookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nQuantcastCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBeeswaxIO CorporationCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSovrn, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nAdikteevDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Non-precise location data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nRTB House S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nThe UK Trade Desk LtdCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNexxen Inc.Cookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEpsilonCookie duration: 1832 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nYahoo EMEA LimitedCookie duration: 750 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nADventori SASCookie duration: 90 (days).Data collected and processed: IP addresses, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTriple Lift, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nXandr, Inc.Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNEORY GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nNexxen Group LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nNEURAL.ONECookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nADITION (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nActive Agent (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nTaboola Europe LimitedCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEquativCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdform A/SCookie duration: 3650 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite, Inc. Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRATEGAIN ADARA INCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nSift Media, IncDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location datamoreView details | Privacy policy\n\nRakuten Marketing LLCCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLumen Research LimitedDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOpenXCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nYieldlab (Virtual Minds GmbH)Cookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nRoku Advertising ServicesCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNano Interactive Group Ltd.Doesn't use cookies.Data collected and processed: Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Privacy policy\n\nSimplifi Holdings LLCCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Precise location datamoreUses other forms of storage.View details | Privacy policy\n\nPubMatic, IncCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nComscore B.V.Cookie duration: 720 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nFlashtalkingCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nPulsePoint, Inc.Cookie duration: 1830 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nSmaato, Inc.Cookie duration: 21 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSemasio GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCrimtan Holdings LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nGenius Sports UK LimitedCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nCriteo SACookie duration: 390 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nAdloox SADoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nBlis Global LimitedCookie duration: 400 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nLotame Solutions, IncCookie duration: 274 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nLiveRampCookie duration: 3653 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nGroupM UK LimitedCookie duration: 395 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLoopMe LimitedCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDynata LLCCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAsk LocalaDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nAziraDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nDoubleVerify Inc.​Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nBIDSWITCH GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nIPONWEB GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nNextRoll, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTeads France SASCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nStröer SSP GmbH (SSP)Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nOS Data Solutions GmbHCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPermodo GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nPlatform161 B.V.Cookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nBasis Global Technologies, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSMADEX, S.L.U.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBombora Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEASYmedia GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRemerge GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreUses other forms of storage.View details | Privacy policy\n\nadvanced store GmbHCookie duration: 365 (days).Data collected and processed: Device identifiersmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMagnite CTV, Inc.Cookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDelta Projects ABCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nusemax advertisement (Emego GmbH)Cookie duration: 365 (days).Data collected and processed: IP addresses, Users’ profilesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nemetriq GmbHCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPublicis Media GmbHCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nM.D. Primis Technologies Ltd.Cookie duration: 25 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreView details | Storage details | Privacy policy\n\nOneTag LimitedCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nCloud Technologies S.A.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nSmartology LimitedDoesn't use cookies.Data collected and processed: IP addressesmoreUses other forms of storage.View details | Privacy policy\n\nImprove DigitalCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAdobe Advertising CloudCookie duration: 730 (days).Data collected and processed: IP addresses, Device identifiers, Authentication-derived identifiers, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nBannerflow ABCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nTabMo SASDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nIntegral Ad Science (incorporating ADmantX)Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location data, Privacy choicesmoreView details | Privacy policy\n\nWizalyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nWeboramaCookie duration: 393 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nJivox CorporationCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSojern, Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nVistar Media EMEA BVDoesn't use cookies.Data collected and processed: Non-precise location datamoreView details | Privacy policy\n\nOn Device Research LimitedCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nRockabox Media LtdDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nExactag GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nCeltra Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Precise location datamoreUses other forms of storage.View details | Storage details | Privacy policy\n\nmainADV SrlCookie duration: 30 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGemius SACookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nThe Kantar Group LimitedCookie duration: 914 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nNielsen Media Research Ltd.Cookie duration: 120 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nSolocal SACookie duration: 398 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nPixalate, Inc.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location datamoreView details | Storage details | Privacy policy\n\nNumberlyCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAudienceProject A/SCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nDemandbase, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nEffiliation / EffinityCookie duration: 30 (days).Data collected and processed: Device characteristicsmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nArrivalist Co.Cookie duration: 365 (days).Data collected and processed: IP addresses, Non-precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nSeenthis ABDoesn't use cookies.Data collected and processed: IP addresses, Device characteristicsmoreView details | Privacy policy\n\nCommanders ActCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiersmoreView details | Storage details | Privacy policy\n\ntravel audience GmbHCookie duration: 397 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Users’ profilesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nHUMANDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Non-precise location datamoreView details | Privacy policy\n\nBlendee srlCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nInnovid LLCCookie duration: 90 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nPapirfly ASDoesn't use cookies.Data collected and processed: Device characteristicsmoreView details | Privacy policy\n\nNeustar, Inc., a TransUnion companyCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nVerve Group Europe GmbHDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOtto GmbH & Co. KGaACookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdobe Audience Manager, Adobe Experience PlatformCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nLocalsensor B.V.Doesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location data, Precise location data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nOnline SolutionCookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Privacy policy\n\nRelay42 Netherlands B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, User-provided data, Users’ profiles, Privacy choicesmoreView details | Storage details | Privacy policy\n\nGP One GmbHCookie duration: Uses session cookies.Data collected and processed: IP addresses, Device characteristics, Browsing and interaction data, User-provided data, Non-precise location data, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nLiftoff Monetize and Vungle ExchangeDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nThe MediaGrid Inc.Cookie duration: 365 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Precise location data, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nReppublika Research & Analytics Austria GmbHCookie duration: 180 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Users’ profilesmoreUses other forms of storage.View details | Privacy policy\n\nCint ABCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreUses other forms of storage.View details | Privacy policy\n\nGoogle Advertising ProductsCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nGfK GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, User-provided data, Non-precise location data, Users’ profiles, Privacy choicesmoreUses other forms of storage.View details | Storage details | Privacy policy\n\nRevJetCookie duration: 365 (days).Data collected and processed: IP addresses, Device identifiers, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nProtected Media LTDDoesn't use cookies.Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction datamoreView details | Privacy policy\n\nClinch Labs LTDCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nHearts and Science München GmbHCookie duration: 60 (days).Data collected and processed: IP addressesmoreCookie duration resets each session. View details | Privacy policy\n\nAmazon AdvertisingCookie duration: 396 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Users’ profiles, Privacy choicesmoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nMoloco, Inc.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Non-precise location datamoreCookie duration resets each session. Uses other forms of storage.View details | Storage details | Privacy policy\n\nAdtriba GmbHCookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Privacy choicesmoreCookie duration resets each session. View details | Privacy policy\n\nEnsightenCookie duration: 1825 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, Privacy choicesmoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nMetrixLab Nederland B.V.Cookie duration: 730 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Browsing and interaction data, User-provided datamoreUses other forms of storage.View details | Privacy policy\n\nHurra Communications GmbHCookie duration: 366 (days).Data collected and processed: IP addresses, Device characteristics, Device identifiers, Probabilistic identifiers, Authentication-derived identifiers, Browsing and interaction data, Non-precise location data, Precise location datamoreCookie duration resets each session. View details | Storage details | Privacy policy\n\nAd partners\n\nAkamaiPrivacy policy\n\nMetaPrivacy policy\n\nAunicaPrivacy policy\n\nBooking.comPrivacy policy\n\nC3 MetricsPrivacy policy\n\nIBMPrivacy policy\n\neBayPrivacy policy\n\nEvidonPrivacy policy\n\nAdacadoPrivacy policy\n\nintelliAdPrivacy policy\n\nDstilleryPrivacy policy\n\nMediaMathPrivacy policy\n\nSizmekPrivacy policy\n\nZMSPrivacy policy\n\nOmnicom Media GroupPrivacy policy\n\nResonatePrivacy policy\n\nSmartPrivacy policy\n\nTradedoubler ABPrivacy policy\n\nTrustArcPrivacy policy\n\nTruEffectPrivacy policy\n\nTravel Data CollectivePrivacy policy\n\nadvolution.controlPrivacy policy\n\nLifeStreetPrivacy policy\n\nBatch MediaPrivacy policy\n\nVodafone GmbHPrivacy policy\n\nMagnitePrivacy policy\n\nScenestealerPrivacy policy\n\nNetquestPrivacy policy\n\nManage.comPrivacy policy\n\nCloudflarePrivacy policy\n\nSalesforce DMPPrivacy policy\n\nNetflixPrivacy policy\n\nebuildersPrivacy policy\n\nAppLovin Corp.Privacy policy\n\nFractional MediaPrivacy policy\n\nRackspacePrivacy policy\n\nMSI-ACIPrivacy policy\n\nAdmetricsPrivacy policy\n\nNaveggPrivacy policy\n\nAdmedoPrivacy policy\n\nKochavaPrivacy policy\n\nMobitransPrivacy policy\n\nADEXPrivacy policy\n\nImpactPrivacy policy\n\nSpotadPrivacy policy\n\nAarkiPrivacy policy\n\nSFRPrivacy policy\n\nCablatoPrivacy policy\n\nWaystackPrivacy policy\n\nTreSensaPrivacy policy\n\nAdludioPrivacy policy\n\ngskinnerPrivacy policy\n\nCUBEDPrivacy policy\n\nOptomatonPrivacy policy\n\nDentsu Aegis NetworkPrivacy policy\n\nDigisegPrivacy policy\n\nHaensel AMSPrivacy policy\n\nBDSK Handels GmbH & Co. KGPrivacy policy\n\nObjective PartnersPrivacy policy\n\nMarketing Science Consulting Group, Inc.Privacy policy\n\nDENTSUPrivacy policy\n\nKoblerPrivacy policy\n\nWidespacePrivacy policy\n\nVimeoPrivacy policy\n\nOracle Data CloudPrivacy policy", "summary": "", "url": "https://www.channelnewsasia.com/business/meta-facebook-landmark-antitrust-trial-sell-instagram-5064611", "image": "https://dam.mediacorp.sg/image/upload/s--fwv_3Ddv--/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2023-11-09t001106z_1_lynxmpeja8004_rtroptp_3_tech-privacy-meta-platforms.jpg?itok=UN9aj0Iq", "video": null, "publish_date": "2025-04-14 10:14:00", "author": null, "language": "en", "source_country": "sg", "sentiment": 0.186}, {"id": 310979768, "title": "NBA sees sport's growth lagging behind potential in Europe", "text": "NEW YORK : The basketball business in Europe is far from living up to its potential, NBA Deputy Commissioner Mark Tatum told Reuters, as the league explores launching a new operation in the continent to take advantage of the sport's skyrocketing popularity.\n\nCommissioner Adam Silver said last month that it was looking into launching NBA Europe with world basketball body FIBA as its partner, with the initial plan to have a 16-team league.\n\nThe league is intended to harness the explosive popularity of the sport in the continent, where Tatum said basketball is second only to soccer, as well as the deep pool of talent, with roughly 15 per cent of all NBA players today from Europe.\n\n\"There's an opportunity to continue to accelerate the growth of basketball in Europe and to close the gap between the affinity for the game of basketball and the commercial viability of basketball in that market as well,\" he told Reuters.\n\nOrganisers of the Euroleague, the continent's existing premier club competition, balked at the idea of a new league, however, and said the plans for a new European league amounted to a threat that could fragment the sport.\n\n\"Our goal is not to replace the Euroleague. Our goal is to create a commercially viable league that features high quality on-court competition and respects the rich tradition of European basketball. And we think that that will better serve fans and players on the continent,\" Tatum said.\n\n\"We've tried for years to bring all of the relevant stakeholders together and we remain open to doing so.\"\n\nTatum pointed to the lack of permanent Euroleague teams in key cities including London, Paris, Berlin and Rome, and said the investment that comes with a new league would help bring sorely needed basketball infrastructure to the region.\n\n\"The lack of world-class basketball facilities in Europe is striking relative to the affinity there,\" Tatum said. \n\n\"There are big markets in Europe that aren't being serviced today, where there are millions of basketball fans that aren't being serviced.\"\n\nThe NBA held early-stage talks with owners of Paris St Germain (PSG) and Manchester City among others, along with possible backers of a London-based team, Bloomberg reported.\n\nA spokesperson for PSG owner Qatar Sports Investments said it had been \"approached with regards to a basketball franchise in Paris in relation to which we have expressed an interest\",\n\nNBA rules would prohibit current team owners from having individual franchises in Europe, Tatum said.\n\nThe potential Europe league extends the NBA's longstanding effort toward globalization, a trend that is happening across the North American \"Big Four\" men's leagues. \n\nFour years ago, the NBA announced the formation of NBA Africa, which co-organizes the Basketball Africa League with FIBA, and Tatum said the league has hosted more than 100 games in Europe.\n\nNowhere was the sport's growing global appeal more obvious than the Paris Olympic Games, where dozens of NBA athletes could be found on teams from Germany to South Sudan. At the 1992 Games, there were only nine international players from the NBA.\n\nA joint-record 125 international players from 43 countries were named to NBA teams at the start of the 2024-25 season.\n\n\"The U.S. Accounts for less than 5 per cent of the world's population so by definition, our biggest opportunities for growth are going to exist outside the United States,\" said Tatum. \n\n\"We want to continue to spur the growth of basketball in Europe, in Africa, in Asia, in South America and Latin America and continue to grow the sport here in North America as well.\"", "summary": "", "url": "https://www.channelnewsasia.com/sport/nba-sees-sports-growth-lagging-behind-potential-europe-5064721", "image": "https://dam.mediacorp.sg/image/upload/s--upgnRNil--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-04-14t110424z_1_lynxmpel3d0ev_rtroptp_3_basketball-nba.jpg?itok=EtE", "video": null, "publish_date": "2025-04-14 11:04:24", "author": null, "language": "en", "source_country": "sg", "sentiment": 0.312}, {"id": 310979770, "title": "Stella hails Norris for shielding team from blame", "text": "SAKHIR, Bahrain :Formula One leader Lando Norris was unsparingly self-critical after suffering setbacks in Bahrain at the weekend but McLaren principal Andrea Stella said the driver was being unfair on himself and taking blame for the team.\n\nNorris said he had been \"clueless on track\" after Saturday qualifying at Sakhir and, after finishing third on Sunday in a race won from pole by teammate Oscar Piastri, that he made too many mistakes.\n\n\"Every time I did one thing good, I did two bad in a way,\" said the Briton, who now leads Australian Piastri by three points.\n\n\"Something’s just not clicking with me and the car. I’m not able to do any of the laps like I was doing last season.\n\n\"The car was just mega and that’s helping me get out of a lot of problems at the minute. But I’m just nowhere near the capability that I have - which hurts,\" he added.\n\nStella told reporters he admired Norris's open approach, wearing his heart on his sleeve rather than erecting a mental screen.\n\n\"It is relatively unique how visible he is, how open he is,\" said the Italian, who worked with seven-times world champion Michael Schumacher at Ferrari. \n\n\"He is quite self-critical. Other champions in the past, might go on about the problem being elsewhere. It is something important that I admire about Lando, and which makes me very privileged and lucky as team principal, that he absorbs the blame and points it at himself.\n\n\"He raises his hand, absolving the team entirely; 'It was me, not the team.' Which is entirely inaccurate. There were things we did that made Lando's life less easy. We know what they were technically,\" he added.\n\n\"Lando is adapting to this. We are working together to fix it. Some other drivers as soon as there is a problem; 'Ah, the team.' Lando does not do that.\"\n\nStella said Norris, winner of the season-opener in Australia, had \"an incredible race craft\" and had simply hit a temporary phase of things not going to plan while pushing the car to its limits.\n\n\"We understand what it is, it will just require a bit of adaptation from Lando himself and some adaptations from the team, but I think the understanding is good and we are very optimistic that this will be resolved.\"\n\nStella said McLaren always shared the blame and \"we know that there's a few things we can do better to make Lando more comfortable in the car.\"\n\nNorris conceded he was hard on himself but it was how he had always operated and it would be harder still not to show his feelings.\n\n\"When I do my interviews and whatever, a lot of it is probably just getting my frustration out. It's just because of not achieving what I want to achieve,\" he said.\n\n\"When I know what I can do and what I'm capable of, and I'm not even close to reaching that... I'm very disappointed in myself.\"", "summary": "", "url": "https://www.channelnewsasia.com/sport/stella-hails-norris-shielding-team-blame-5064726", "image": "https://dam.mediacorp.sg/image/upload/s--gaCsrbz6--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-04-14t111229z_1_lynxmpel3d0fc_rtroptp_3_motor-f1-bahrain.jpg?itok=G", "video": null, "publish_date": "2025-04-14 11:12:29", "author": null, "language": "en", "category": "politics", "source_country": "sg", "sentiment": -0.399}, {"id": 310979766, "title": "More than S$400,000 lost to phishing scams impersonating OneMotoring", "text": "SINGAPORE: The police have warned about a resurgence of phishing scams impersonating the Land Transport Authority’s (LTA) OneMotoring platform. \n\nAt least 37 cases have been reported since December 2024, with at least S$407,000 (US$309,000) lost, said the Singapore Police Force (SPF) in a news release on Monday (Apr 14). \n\nThe recent cases involved victims receiving text messages, purportedly from OneMotoring, informing them about unpaid bills.\n\nThe messages would contain a link that redirected people to a phishing payment site impersonating OneMotoring. They were then prompted to key in their personal information, credit or debit card details and other sensitive information.\n\nThe victims only realised they had been scammed when they discovered unauthorised transactions made to their credit or debit cards. \n\n“Messages from LTA on unpaid road tax bills do not contain payment links to the OneMotoring website or to payment portals,” said the police. \n\nNotifications from the transport authority about a vehicle’s road tax expiry come in three forms - SMSes through the “gov.sg” sender identification, e-letters deposited into the owner’s OneMotoring account, accessible only via Singpass login, or hardcopy letters sent to their registered address.\n\nThe police advised that when in doubt, people should always verify the authenticity of the information provided with LTA through its website or hotline number.\n\nIn September last year, at least S$28,000 were lost to phishing scams impersonating OneMotoring in less than three weeks.\n\nFor those cases, victims received emails, purportedly from OneMotoring, about their vehicles’ road tax or road licence expiry.", "summary": "At least 37 cases have been reported since December 2024.", "url": "https://www.channelnewsasia.com/singapore/onemotoring-impersonation-phishing-scams-lta-police-5064656", "image": "https://dam.mediacorp.sg/image/upload/s--wIy4k0cz--/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/mediacorp/cna/image/2025/04/14/6046385664762693577.jpg?itok=KIui_K5D", "video": null, "publish_date": "2025-04-14 10:55:24", "author": "Rachel Lim", "authors": ["Rachel Lim"], "language": "en", "source_country": "sg", "sentiment": -0.51}, {"id": 310978896, "title": "Quinta Brunson to host the next episode of \"Saturday Night Live\"", "text": "This will be Brunson's second time hosting \"Saturday Night Live\" (or as some call it, half-a-Hamm), so the first time around must have been sufficient. Also, her sitcom is still on the air and maybe the only network comedy with any real sway in the world at large, so Brunson may have had to be Steven Seagal bad not to get a second opportunity.\n\nThe musical guest will be Benson Boone.\n\nWhile \"Saturday Night Live\" will often turn to social media to post upcoming hosts and musical guests, they could do this one during the Hamm episode because the show is off for a couple weeks. Brunson and Boone will be on your screens on May 3. \n\nGood thing the show got its \"White Lotus\" parody in while it could.", "summary": "Brunson and Benson Boone will be on your screens on May 3. ", "url": "https://www.yardbarker.com/entertainment/articles/quinta_brunson_to_host_the_next_episode_of_saturday_night_live/s1_13132_42046235", "image": "https://www.yardbarker.com/media/7/5/759b57d390fdfdddcd63cef3a345f78fb25aa473/thumb_16x9/quinta-brunson-host-next-episode-saturday-night.jpg?v=1", "video": null, "publish_date": "2025-04-14 04:01:01", "author": "Chris Morgan,Yardbarker", "authors": ["Chris Morgan", "Yardbarker"], "language": "en", "source_country": "us", "sentiment": -0.105}, {"id": 310975262, "title": "Gecə hava kəskin dəyişəcək -", "text": "Rayonlarda gözlənilən hidrometeoroloji hadisə haqqında əhaliyə xəbərdarlıq edilib.\n\nMetbuat.az xəbər verir ki, bu barədə Milli Hidrometeorologiya Xidmətindən məlumat verilib.\n\nAzərbaycanın rayonlarında aprelin 14-dən 15-nə keçən gecədən başlayaraq ölkə ərazisindən soyuq atmosfer cəbhəsinin keçməsi nəticəsində hava şəraitinin qeyri-sabit, yağıntılı keçəcəyi gözlənilir.\n\nAprelin 15-də bəzi yerlərdə yağıntıların intensivləşəcəyi (Böyük və Kiçik Qafqaz rayonları), əsasən şimal və şərq rayonlarında (Balakən-Şəki, Dağlıq Şirvan, Quba-Qusar) güclü olacağı gözlənilir.\n\nAprelin 16-da isə prosesin daha da kəskinləşəcəyi, leysan yağışının aramsız, əksər rayonlarda intensiv və güclü olacağı ehtimalı yüksəkdir.\n\nProsesin şimşəklə müşayiət olunacağı, dolu düşəcəyi, dağlıq ərazilərdə qar yağacağı ehtimalı var.\n\nAprelin 15-16-da qərb küləyi 15-20 m/s, bəzi yerlərdə arabir 25-30 m/s-dək güclənəcək.\n\nAprelin 14-dən 15-nə keçən gecədən başlayaraq 17-dək gözlənilən proses ilə əlaqədar transsərhəd və ölkənin əksər yerli çaylarında yüksək sululuğun davam edəcəyi, əsasən dağ çaylarından sel və daşqın keçəcəyi gözlənilir.", "summary": "Metbuat.az xəbər verir ki, bu barədə Milli Hidrometeorologiya Xidmətindən məlumat verilib.Azərbaycanın rayonlarında aprelin 14-dən 15-nə k", "url": "https://metbuat.az/news/1523264/gece-hava-keskin-deyisecek.html", "image": "https://metbuat.az/images/metbuat/images_o/1523264.jpg", "video": null, "publish_date": "2025-04-14 11:08:00", "author": null, "language": "en", "source_country": "az", "sentiment": 0.252}, {"id": 310979762, "title": "UK confident of keeping British Steel going after taking control", "text": "SCUNTHORPE, England: Britain expressed confidence on Monday (Apr 14) that it could secure enough raw materials to keep the blast furnaces at its last maker of virgin steel burning, after the government seized operational control from its Chinese owners.\n\nMinisters said British Steel's owners, China's Jingye Group, had wanted to shut the furnaces at the Scunthorpe plant after they rejected a government funding proposal, which would have forced Britain to import steel instead.\n\nThe government recalled parliament at the weekend - the first Saturday recall since the 1982 Falklands War - to give it powers to direct the company's board and workforce and to order raw materials.\n\nBy Monday morning, it had approved the appointment of an interim chief executive and chief commercial officer - both long-term employees of the plant - and said it had established that enough raw materials were in the country.\n\n\"We need to make sure we get it into the blast furnaces,\" Treasury department minister James Murray said.\n\nA number of businesses, including India's Tata and local distributor Rainham Steel, had also offered managerial support and raw materials, the government said.\n\nThe dispute risks straining ties between London and Beijing, which Prime Minister Keir Starmer's Labour government had sought to improve, at a time when nations around the world are trying to deepen trading cooperation after the US tariff shock.\n\nJingye has not commented, but China called for fair treatment of its companies and resolution through consultation.\n\n\"The facts on the ground are very clear that if we hadn't taken the action that we did on Saturday, then the blast furnaces would be closing,\" Murray said, calling steel production a national security matter.\n\nThe furnaces in the northeastern city of Scunthorpe need to be constantly fuelled and are losing 700,000 pounds (US$922,000) a day.\n\nTheir output is used in the rail network, construction and automotive industry. Without the plant, Britain would be reliant on imports at a time of trade wars and geopolitical instability.\n\nThe intervention at a site which employs 3,500 people and more in the supply chain prompted Britain's business minister, Jonathan Reynolds, to say on Sunday that China was no longer welcome in Britain's steel sector.", "summary": "", "url": "https://www.channelnewsasia.com/world/uk-british-steel-takeover-china-5064756", "image": "https://dam.mediacorp.sg/image/upload/s--r_l4E7SH--/c_crop,h_562,w_1000,x_0,y_34/fl_relative,g_south_east,l_one-cms:core:watermark:ap_data-1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/britain_steel_38313.jpg?itok=NwwA1Z2B", "video": null, "publish_date": "2025-04-14 11:42:31", "author": null, "language": "en", "category": "politics", "source_country": "sg", "sentiment": -0.374}, {"id": 310979764, "title": "Italy 2026 Winter Games, Paralympics torches unveiled in Milan", "text": "MILAN : The torches that will carry the Olympic flame for the 2026 Winter Games and Paralympics were unveiled on Monday in Milan and at a parallel event in the Italian pavilion at Expo 2025 in the Japanese city of Osaka.\n\nMade from recycled aluminium, the torches have been styled in two different versions, blue-coloured for the Olympics and bronze for the Paralympics.\n\nFormer cross-country skier Stefania Belmondo and Paralympic fencing star Bebe Vio, both double Olympic gold medallists, brought the torches into a Milan theatre.\n\n\"It's very easy to carry on and it's easy to handle,\" said Belmondo, who lit the Olympic cauldron at the 2006 Games in Turin, when Italy last hosted the Winter Games.\n\nStyled by Carlo Ratti Associati, a Turin-based design firm, the surface of each torch is intended to reflect the landscape it will cross during its relay, and to put the Olympic flame itself in the spotlight, organisers said.\n\n\"The torch is spectacular, beautiful, the embodiment of Italian design genius,\" said Giovanni Malago, Italy's National Olympic Committee president.\n\nMilan and the town of Cortina d'Ampezzo, one of Italy's most famous ski resorts, are the main hosts of the Games, which run from February 6 to 22 next year. The Paralympics will follow the following month.\n\nThe torch will be lit at Greece's ancient Olympia, the birthplace of the Olympics, on November 26, marking the countdown to the Games.\n\nIt is scheduled to arrive in Rome at the beginning of December and will continue its relay across Italy before reaching Milan for the lighting of the cauldron at the opening ceremony.\n\nAside from Milan and Cortina - which are more than 400 km (250 miles) apart - events will be staged at five other locations, including Bormio, where the men's Alpine skiing races will take place.", "summary": "", "url": "https://www.channelnewsasia.com/sport/italy-2026-winter-games-paralympics-torches-unveiled-milan-5064766", "image": "https://dam.mediacorp.sg/image/upload/s--S8wGv4SS--/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/c_fill,g_auto,h_338,w_600/v1/one-cms/core/2025-04-14t114815z_1_lynxmpel3d0gn_rtroptp_3_olympics-2026.jpg?itok=pvm2", "video": null, "publish_date": "2025-04-14 11:48:15", "author": null, "language": "en", "source_country": "sg", "sentiment": 0.455}], "date_updated": "2025-04-14 14:02:18.514419"}